marius9043/TMC2209_stm32/src/TMC2209/TMC2209.cpp
  // Wait for the transmission of outgoing serial data to complete
  serialFlush();

  // clear the serial receive buffer if necessary
  while (serialAvailable() > 0)
  {
    byte = serialRead();
  }

  // write datagram
  for (uint8_t i=0; i<datagram_size; ++i)
  {
    byte = (datagram.bytes >> (i * BITS_PER_BYTE)) & BYTE_MAX_VALUE;
    serialWrite(byte);
  }

  // Wait for the transmission of outgoing serial data to complete
  serialFlush();

  // wait for bytes sent out on TX line to be echoed on RX line
  // uint32_t echo_delay = 0;
  // while ((serialAvailable() < datagram_size) and
  //  (echo_delay < ECHO_DELAY_MAX_MICROSECONDS))
  // {
  //  delayMicroseconds(ECHO_DELAY_INC_MICROSECONDS);
  //  echo_delay += ECHO_DELAY_INC_MICROSECONDS;
  // }

  // if (echo_delay >= ECHO_DELAY_MAX_MICROSECONDS)
  // {
  //   return;
  // }

  // clear RX buffer of echo bytes
  // for (uint8_t i=0; i<datagram_size; ++i)
  // {
  //   byte = serialRead();
  // }
}

void TMC2209::write(uint8_t register_address,
  uint32_t data)
{
  WriteReadReplyDatagram write_datagram;
  write_datagram.bytes = 0;
  write_datagram.sync = SYNC;
  write_datagram.serial_address = serial_address_;
  write_datagram.register_address = register_address;
  write_datagram.rw = RW_WRITE;
  write_datagram.data = reverseData(data);
  write_datagram.crc = calculateCrc(write_datagram, WRITE_READ_REPLY_DATAGRAM_SIZE);

  sendDatagramUnidirectional(write_datagram, WRITE_READ_REPLY_DATAGRAM_SIZE);
}

uint32_t TMC2209::read(uint8_t register_address)
{
  ReadRequestDatagram read_request_datagram;
  read_request_datagram.bytes = 0;
  read_request_datagram.sync = SYNC;
  read_request_datagram.serial_address = serial_address_;
  read_request_datagram.register_address = register_address;
  read_request_datagram.rw = RW_READ;
  read_request_datagram.crc = calculateCrc(read_request_datagram, READ_REQUEST_DATAGRAM_SIZE);

  for (uint8_t retry = 0; retry < MAX_READ_RETRIES; retry++)
  {
    // This now sends the request without handling echo internally
    sendDatagramBidirectional(read_request_datagram, READ_REQUEST_DATAGRAM_SIZE);
    
    // ------ START OF ADDED/MODIFIED CODE ------
#if defined(ARDUINO_ARCH_STM32) // Use appropriate define for your STM32 core
    if (hardware_serial_ptr_ != nullptr)
    {
      // Clear buffer right before enabling RX, just in case
      while (serialAvailable() > 0)
      {
        serialRead();
      }
      // Enable Half-Duplex Receive mode
      hardware_serial_ptr_->enableHalfDuplexRx();
    }
#endif
    // ------- END OF ADDED/MODIFIED CODE -------

    // Wait for the reply datagram to arrive
    uint32_t reply_delay = 0;
    while ((serialAvailable() < WRITE_READ_REPLY_DATAGRAM_SIZE) and
      (reply_delay < REPLY_DELAY_MAX_MICROSECONDS))
    {
      delayMicroseconds(REPLY_DELAY_INC_MICROSECONDS);
      reply_delay += REPLY_DELAY_INC_MICROSECONDS;
    }

    // if (reply_delay >= REPLY_DELAY_MAX_MICROSECONDS)
    // {
    //   return 0;
    // }
    if (reply_delay >= REPLY_DELAY_MAX_MICROSECONDS)
    {
      // If timed out, continue to the next retry attempt
      if (retry < MAX_READ_RETRIES - 1)
      {
        delay(READ_RETRY_DELAY_MS);
        continue;
      }
      else
      {
        // Failed all retries
        return 0; // Or indicate error differently
      }
    }


    // uint64_t byte;
    // uint8_t byte_count = 0;
    // WriteReadReplyDatagram read_reply_datagram;
    // read_reply_datagram.bytes = 0;
    // for (uint8_t i=0; i<WRITE_READ_REPLY_DATAGRAM_SIZE; ++i)
    // {
    //   byte = serialRead();
    //   read_reply_datagram.bytes |= (byte << (byte_count++ * BITS_PER_BYTE));
    // }

    // auto crc = calculateCrc(read_reply_datagram, WRITE_READ_REPLY_DATAGRAM_SIZE);
    // if (crc == read_reply_datagram.crc)
    // {
    //   return reverseData(read_reply_datagram.data);
    // }
    // 
    // delay(READ_RETRY_DELAY_MS);
  // }

  // return 0;
// }
    // If bytes are available, read them
    uint64_t byte_read = 0; // Use appropriate type
    uint8_t byte_count = 0;
    WriteReadReplyDatagram read_reply_datagram;
    read_reply_datagram.bytes = 0;

    // Read the reply bytes (consider adding per-byte timeout if needed)
    // This assumes serialAvailable() returning >= expected size means data is ready
    for (uint8_t i = 0; i < WRITE_READ_REPLY_DATAGRAM_SIZE; ++i)
    {
      // Reading one byte at a time
      int single_byte = serialRead();
      if (single_byte != -1)
      { // Check if read was successful
        read_reply_datagram.bytes |= ((uint64_t)single_byte << (byte_count++ * BITS_PER_BYTE));
      }
      else
      {
        // Error reading byte (e.g., timeout if serialRead has one)
        // Break or handle error - relying on outer timeout for now
        byte_count = 0; // Mark as incomplete read
        break;
      }
    }

    // Check CRC only if we received the expected number of bytes
    if (byte_count == WRITE_READ_REPLY_DATAGRAM_SIZE)
    {
      auto crc = calculateCrc(read_reply_datagram, WRITE_READ_REPLY_DATAGRAM_SIZE);
      if (crc == read_reply_datagram.crc)
      {
        // Success! Return the data.
        return reverseData(read_reply_datagram.data);
      }
      // CRC error - fall through to retry delay
    }
    // Incomplete read or CRC error, delay before next retry
    if (retry < MAX_READ_RETRIES - 1)
    {
      delay(READ_RETRY_DELAY_MS);
    }

  } // End retry loop

  return 0; // Return 0 if all retries fail
}

uint8_t TMC2209::percentToCurrentSetting(uint8_t percent)
{
  uint8_t constrained_percent = constrain_(percent,
    PERCENT_MIN,
    PERCENT_MAX);
  uint8_t current_setting = map(constrained_percent,
    PERCENT_MIN,
    PERCENT_MAX,
    CURRENT_SETTING_MIN,
    CURRENT_SETTING_MAX);
  return current_setting;
}

uint8_t TMC2209::currentSettingToPercent(uint8_t current_setting)
{
  uint8_t percent = map(current_setting,
    CURRENT_SETTING_MIN,
    CURRENT_SETTING_MAX,
    PERCENT_MIN,
    PERCENT_MAX);
  return percent;
}

uint8_t TMC2209::percentToHoldDelaySetting(uint8_t percent)
{
  uint8_t constrained_percent = constrain_(percent,
    PERCENT_MIN,
    PERCENT_MAX);
  uint8_t hold_delay_setting = map(constrained_percent,
    PERCENT_MIN,
    PERCENT_MAX,
    HOLD_DELAY_MIN,
    HOLD_DELAY_MAX);
  return hold_delay_setting;
}

uint8_t TMC2209::holdDelaySettingToPercent(uint8_t hold_delay_setting)
{
  uint8_t percent = map(hold_delay_setting,
    HOLD_DELAY_MIN,
    HOLD_DELAY_MAX,
    PERCENT_MIN,
    PERCENT_MAX);
  return percent;
}

void TMC2209::writeStoredGlobalConfig()
{
  write(ADDRESS_GCONF, global_config_.bytes);
}

uint32_t TMC2209::readGlobalConfigBytes()
{
  return read(ADDRESS_GCONF);
}

void TMC2209::writeStoredDriverCurrent()
{
  write(ADDRESS_IHOLD_IRUN, driver_current_.bytes);

  if (driver_current_.irun >= SEIMIN_UPPER_CURRENT_LIMIT)
  {
    cool_config_.seimin = SEIMIN_UPPER_SETTING;
  }
  else
  {
    cool_config_.seimin = SEIMIN_LOWER_SETTING;
  }
  if (cool_step_enabled_)
  {
    write(ADDRESS_COOLCONF, cool_config_.bytes);
  }
}

void TMC2209::writeStoredChopperConfig()
{
  write(ADDRESS_CHOPCONF, chopper_config_.bytes);
}

uint32_t TMC2209::readChopperConfigBytes()
{
  return read(ADDRESS_CHOPCONF);
}

void TMC2209::writeStoredPwmConfig()
{
  write(ADDRESS_PWMCONF, pwm_config_.bytes);
}

uint32_t TMC2209::readPwmConfigBytes()
{
  return read(ADDRESS_PWMCONF);
}

uint32_t TMC2209::constrain_(uint32_t value, uint32_t low, uint32_t high)
{
  return ((value)<(low)?(low):((value)>(high)?(high):(value)));
}
